In [29]:
import pandas as pd
import numpy as np

In [30]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'],
    'labels' : ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
            }

In [31]:
exam__data = pd.DataFrame(exam_data)

In [32]:
exam__data = exam__data.set_index("labels")

In [33]:
exam__data.head(3)

             name  score  attempts qualify
labels
a       Anastasia   12.5         1     yes
b            Dima    9.0         3      no
c       Katherine   16.5         2     yes

In [34]:
exam__data.dropna(inplace=True)

In [35]:
exam__data[["name","score"]]

             name  score
labels
a       Anastasia   12.5
b            Dima    9.0
c       Katherine   16.5
e           Emily    9.0
f         Michael   20.0
g         Matthew   14.5
i           Kevin    8.0
j           Jonas   19.0

In [36]:
new = pd.DataFrame({"name" : "Suresh", "score": 15.5, "attempts": 1, "qualify": "yes"}, index=["k"])

In [37]:
new

     name  score  attempts qualify
k  Suresh   15.5         1     yes

In [38]:
exam__data.append(new)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Suresh   15.5         1     yes

In [39]:
exam__data = exam__data.drop("attempts", axis =1)

In [40]:
exam__data

             name  score qualify
labels
a       Anastasia   12.5     yes
b            Dima    9.0      no
c       Katherine   16.5     yes
e           Emily    9.0      no
f         Michael   20.0     yes
g         Matthew   14.5     yes
i           Kevin    8.0      no
j           Jonas   19.0     yes

In [44]:
exam__data.loc[exam__data["score"] > 10 , "Success"] = 1
exam__data.loc[exam__data["score"] < 10 , "Success"] = 0

In [45]:
exam__data

             name  score qualify  Success
labels
a       Anastasia   12.5     yes      1.0
b            Dima    9.0      no      0.0
c       Katherine   16.5     yes      1.0
e           Emily    9.0      no      0.0
f         Michael   20.0     yes      1.0
g         Matthew   14.5     yes      1.0
i           Kevin    8.0      no      0.0
j           Jonas   19.0     yes      1.0

In [ ]:
.to_csv('data.csv')